; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
;; blocks=216, out_folder=./training, instance_id=32, seed=2056, goal_proportion=0.03

(define (problem blocksworld-32)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 b20 b21 b22 b23 b24 b25 b26 b27 b28 b29 b30 b31 b32 b33 b34 b35 b36 b37 b38 b39 b40 b41 b42 b43 b44 b45 b46 b47 b48 b49 b50 b51 b52 b53 b54 b55 b56 b57 b58 b59 b60 b61 b62 b63 b64 b65 b66 b67 b68 b69 b70 b71 b72 b73 b74 b75 b76 b77 b78 b79 b80 b81 b82 b83 b84 b85 b86 b87 b88 b89 b90 b91 b92 b93 b94 b95 b96 b97 b98 b99 b100 b101 b102 b103 b104 b105 b106 b107 b108 b109 b110 b111 b112 b113 b114 b115 b116 b117 b118 b119 b120 b121 b122 b123 b124 b125 b126 b127 b128 b129 b130 b131 b132 b133 b134 b135 b136 b137 b138 b139 b140 b141 b142 b143 b144 b145 b146 b147 b148 b149 b150 b151 b152 b153 b154 b155 b156 b157 b158 b159 b160 b161 b162 b163 b164 b165 b166 b167 b168 b169 b170 b171 b172 b173 b174 b175 b176 b177 b178 b179 b180 b181 b182 b183 b184 b185 b186 b187 b188 b189 b190 b191 b192 b193 b194 b195 b196 b197 b198 b199 b200 b201 b202 b203 b204 b205 b206 b207 b208 b209 b210 b211 b212 b213 b214 b215 b216 - object)
 (:init 
    (arm-empty)
    (clear b205)
    (on b205 b169)
    (on b169 b147)
    (on b147 b39)
    (on b39 b17)
    (on b17 b15)
    (on b15 b33)
    (on-table b33)
    (clear b209)
    (on-table b209)
    (clear b139)
    (on b139 b128)
    (on b128 b158)
    (on b158 b107)
    (on b107 b162)
    (on b162 b21)
    (on b21 b87)
    (on b87 b152)
    (on b152 b49)
    (on b49 b142)
    (on b142 b90)
    (on b90 b70)
    (on-table b70)
    (clear b104)
    (on b104 b91)
    (on-table b91)
    (clear b75)
    (on b75 b8)
    (on-table b8)
    (clear b109)
    (on b109 b163)
    (on b163 b132)
    (on b132 b149)
    (on b149 b99)
    (on b99 b140)
    (on b140 b125)
    (on b125 b206)
    (on-table b206)
    (clear b135)
    (on b135 b93)
    (on b93 b57)
    (on-table b57)
    (clear b84)
    (on b84 b216)
    (on b216 b94)
    (on b94 b95)
    (on-table b95)
    (clear b31)
    (on-table b31)
    (clear b14)
    (on b14 b25)
    (on b25 b103)
    (on b103 b137)
    (on-table b137)
    (clear b179)
    (on b179 b165)
    (on b165 b44)
    (on b44 b22)
    (on-table b22)
    (clear b51)
    (on b51 b124)
    (on-table b124)
    (clear b23)
    (on-table b23)
    (clear b153)
    (on b153 b214)
    (on b214 b79)
    (on b79 b168)
    (on-table b168)
    (clear b131)
    (on-table b131)
    (clear b96)
    (on b96 b122)
    (on b122 b207)
    (on b207 b161)
    (on b161 b72)
    (on-table b72)
    (clear b34)
    (on b34 b88)
    (on-table b88)
    (clear b174)
    (on-table b174)
    (clear b101)
    (on b101 b202)
    (on b202 b175)
    (on-table b175)
    (clear b4)
    (on b4 b20)
    (on b20 b166)
    (on b166 b141)
    (on b141 b177)
    (on b177 b201)
    (on b201 b208)
    (on b208 b76)
    (on-table b76)
    (clear b65)
    (on-table b65)
    (clear b146)
    (on-table b146)
    (clear b134)
    (on b134 b115)
    (on b115 b133)
    (on b133 b180)
    (on-table b180)
    (clear b167)
    (on b167 b6)
    (on-table b6)
    (clear b210)
    (on b210 b215)
    (on-table b215)
    (clear b143)
    (on b143 b118)
    (on b118 b127)
    (on b127 b197)
    (on-table b197)
    (clear b36)
    (on b36 b71)
    (on-table b71)
    (clear b40)
    (on-table b40)
    (clear b92)
    (on b92 b80)
    (on-table b80)
    (clear b151)
    (on b151 b111)
    (on b111 b185)
    (on b185 b113)
    (on b113 b184)
    (on b184 b7)
    (on b7 b199)
    (on b199 b195)
    (on b195 b211)
    (on b211 b160)
    (on-table b160)
    (clear b155)
    (on b155 b110)
    (on b110 b78)
    (on b78 b27)
    (on-table b27)
    (clear b53)
    (on b53 b18)
    (on-table b18)
    (clear b30)
    (on b30 b47)
    (on-table b47)
    (clear b192)
    (on b192 b203)
    (on b203 b54)
    (on b54 b194)
    (on b194 b58)
    (on b58 b98)
    (on b98 b145)
    (on b145 b69)
    (on b69 b64)
    (on b64 b117)
    (on b117 b38)
    (on b38 b193)
    (on b193 b26)
    (on b26 b196)
    (on b196 b41)
    (on b41 b105)
    (on b105 b126)
    (on-table b126)
    (clear b19)
    (on b19 b68)
    (on-table b68)
    (clear b55)
    (on b55 b85)
    (on b85 b164)
    (on b164 b48)
    (on b48 b189)
    (on b189 b144)
    (on b144 b108)
    (on b108 b73)
    (on b73 b11)
    (on b11 b183)
    (on b183 b83)
    (on b83 b170)
    (on b170 b171)
    (on b171 b116)
    (on-table b116)
    (clear b172)
    (on b172 b74)
    (on-table b74)
    (clear b86)
    (on b86 b50)
    (on b50 b159)
    (on-table b159)
    (clear b186)
    (on-table b186)
    (clear b157)
    (on b157 b37)
    (on b37 b2)
    (on b2 b81)
    (on b81 b198)
    (on b198 b10)
    (on-table b10)
    (clear b16)
    (on b16 b188)
    (on-table b188)
    (clear b148)
    (on-table b148)
    (clear b97)
    (on b97 b35)
    (on-table b35)
    (clear b56)
    (on b56 b46)
    (on b46 b29)
    (on b29 b156)
    (on b156 b42)
    (on-table b42)
    (clear b12)
    (on b12 b114)
    (on b114 b136)
    (on-table b136)
    (clear b200)
    (on b200 b178)
    (on b178 b213)
    (on b213 b120)
    (on-table b120)
    (clear b63)
    (on b63 b9)
    (on b9 b173)
    (on b173 b32)
    (on-table b32)
    (clear b89)
    (on b89 b61)
    (on b61 b60)
    (on b60 b62)
    (on b62 b154)
    (on b154 b123)
    (on b123 b45)
    (on b45 b102)
    (on b102 b121)
    (on b121 b77)
    (on b77 b190)
    (on b190 b67)
    (on b67 b138)
    (on-table b138)
    (clear b82)
    (on-table b82)
    (clear b212)
    (on b212 b13)
    (on b13 b1)
    (on b1 b106)
    (on b106 b119)
    (on b119 b3)
    (on b3 b191)
    (on-table b191)
    (clear b24)
    (on b24 b59)
    (on b59 b176)
    (on b176 b100)
    (on b100 b5)
    (on b5 b204)
    (on b204 b28)
    (on b28 b187)
    (on b187 b43)
    (on b43 b52)
    (on b52 b112)
    (on b112 b129)
    (on b129 b182)
    (on b182 b66)
    (on-table b66)
    (clear b150)
    (on b150 b181)
    (on b181 b130)
    (on-table b130))
 (:goal  (and 
    (clear b5)
    (on b5 b4)
    (on-table b4)
    (clear b1)
    (on b1 b2)
    (on b2 b3)
    (on b3 b6)
    (on-table b6))))

; plan
1. (unstack b4 b20)
   deleted: (on b4 b20) (clear b4) (arm-empty)
   added: (holding b4) (clear b20)
   goals met: 1 of 8
2. (putdown b4)
   deleted: (holding b4)
   added: (clear b4) (arm-empty) (on-table b4)
   goals met: 2 of 8
3. (unstack b157 b37)
   deleted: (on b157 b37) (clear b157) (arm-empty)
   added: (holding b157) (clear b37)
   goals met: 2 of 8
4. (putdown b157)
   deleted: (holding b157)
   added: (clear b157) (arm-empty) (on-table b157)
   goals met: 2 of 8
5. (unstack b167 b6)
   deleted: (on b167 b6) (clear b167) (arm-empty)
   added: (holding b167) (clear b6)
   goals met: 2 of 8
6. (putdown b167)
   deleted: (holding b167)
   added: (clear b167) (arm-empty) (on-table b167)
   goals met: 2 of 8
7. (unstack b212 b13)
   deleted: (on b212 b13) (clear b212) (arm-empty)
   added: (holding b212) (clear b13)
   goals met: 2 of 8
8. (putdown b212)
   deleted: (holding b212)
   added: (clear b212) (arm-empty) (on-table b212)
   goals met: 2 of 8
9. (unstack b13 b1)
   deleted: (on b13 b1) (clear b13) (arm-empty)
   added: (holding b13) (clear b1)
   goals met: 3 of 8
10. (putdown b13)
   deleted: (holding b13)
   added: (clear b13) (arm-empty) (on-table b13)
   goals met: 3 of 8
11. (unstack b24 b59)
   deleted: (on b24 b59) (clear b24) (arm-empty)
   added: (holding b24) (clear b59)
   goals met: 3 of 8
12. (putdown b24)
   deleted: (holding b24)
   added: (clear b24) (arm-empty) (on-table b24)
   goals met: 3 of 8
13. (unstack b37 b2)
   deleted: (on b37 b2) (clear b37) (arm-empty)
   added: (holding b37) (clear b2)
   goals met: 3 of 8
14. (putdown b37)
   deleted: (holding b37)
   added: (clear b37) (arm-empty) (on-table b37)
   goals met: 3 of 8
15. (unstack b59 b176)
   deleted: (on b59 b176) (clear b59) (arm-empty)
   added: (holding b59) (clear b176)
   goals met: 3 of 8
16. (putdown b59)
   deleted: (holding b59)
   added: (clear b59) (arm-empty) (on-table b59)
   goals met: 3 of 8
17. (unstack b176 b100)
   deleted: (on b176 b100) (clear b176) (arm-empty)
   added: (holding b176) (clear b100)
   goals met: 3 of 8
18. (putdown b176)
   deleted: (holding b176)
   added: (clear b176) (arm-empty) (on-table b176)
   goals met: 3 of 8
19. (unstack b100 b5)
   deleted: (on b100 b5) (clear b100) (arm-empty)
   added: (holding b100) (clear b5)
   goals met: 4 of 8
20. (putdown b100)
   deleted: (holding b100)
   added: (clear b100) (arm-empty) (on-table b100)
   goals met: 4 of 8
21. (unstack b1 b106)
   deleted: (on b1 b106) (clear b1) (arm-empty)
   added: (holding b1) (clear b106)
   goals met: 3 of 8
22. (stack b1 b2)
   deleted: (clear b2) (holding b1)
   added: (arm-empty) (clear b1) (on b1 b2)
   goals met: 5 of 8
23. (unstack b106 b119)
   deleted: (on b106 b119) (clear b106) (arm-empty)
   added: (holding b106) (clear b119)
   goals met: 5 of 8
24. (putdown b106)
   deleted: (holding b106)
   added: (clear b106) (arm-empty) (on-table b106)
   goals met: 5 of 8
25. (unstack b119 b3)
   deleted: (on b119 b3) (clear b119) (arm-empty)
   added: (holding b119) (clear b3)
   goals met: 5 of 8
26. (putdown b119)
   deleted: (holding b119)
   added: (clear b119) (arm-empty) (on-table b119)
   goals met: 5 of 8
27. (unstack b3 b191)
   deleted: (on b3 b191) (clear b3) (arm-empty)
   added: (holding b3) (clear b191)
   goals met: 5 of 8
28. (stack b3 b6)
   deleted: (clear b6) (holding b3)
   added: (arm-empty) (clear b3) (on b3 b6)
   goals met: 6 of 8
29. (unstack b5 b204)
   deleted: (on b5 b204) (clear b5) (arm-empty)
   added: (holding b5) (clear b204)
   goals met: 5 of 8
30. (stack b5 b4)
   deleted: (clear b4) (holding b5)
   added: (arm-empty) (clear b5) (on b5 b4)
   goals met: 7 of 8
31. (unstack b1 b2)
   deleted: (on b1 b2) (clear b1) (arm-empty)
   added: (holding b1) (clear b2)
   goals met: 5 of 8
32. (putdown b1)
   deleted: (holding b1)
   added: (clear b1) (arm-empty) (on-table b1)
   goals met: 6 of 8
33. (unstack b2 b81)
   deleted: (on b2 b81) (clear b2) (arm-empty)
   added: (holding b2) (clear b81)
   goals met: 6 of 8
34. (stack b2 b3)
   deleted: (clear b3) (holding b2)
   added: (arm-empty) (clear b2) (on b2 b3)
   goals met: 7 of 8
35. (pickup b1)
   deleted: (clear b1) (on-table b1) (arm-empty)
   added: (holding b1)
   goals met: 6 of 8
36. (stack b1 b2)
   deleted: (clear b2) (holding b1)
   added: (arm-empty) (clear b1) (on b1 b2)
   goals met: 8 of 8
